{"id":15867,"date":"2021-09-27T19:10:05","date_gmt":"2021-09-27T14:10:05","guid":{"rendered":"https:\/\/slasscom.lk\/?p=15867"},"modified":"2021-09-27T19:10:05","modified_gmt":"2021-09-27T14:10:05","slug":"slasscom-launches-dual-state-of-the-industry-reports-for-it-bpm-sector","status":"publish","type":"post","link":"https:\/\/slasscom.lk\/slasscom-launches-dual-state-of-the-industry-reports-for-it-bpm-sector\/","title":{"rendered":"SLASSCOM launches dual state-of-the-industry reports for IT-BPM sector"},"content":{"rendered":"<p>The Sri Lanka Association of Software and Services Companies (SLASSCOM) recently launched two new reports that comprised of the IT-BPM industry review ‘State of the Industry Report 2019\/20’ and the ‘SLASSCOM State of the BPM Industry Report’. This is the first time that a specific report on the BPM industry has been released.<\/p>\n<p>Thanking all the parties who supported the publications, Immediate Past Chairman Channa Manoharan urged everyone to use the reports in taking out the message of the IOI value proposition to Sri Lanka and beyond. “Publishing these state-of-the-industry reports in partnership with PWC and ACCA has been a rewarding task, since these publications showcase the growth and development of the sectors and will act as a launchpad for the next phase of progress we are getting into,” he stated.<\/p>\n<p>Chief Guest Ministry of Technology Secretary Jayantha De Silva congratulated SLASSCOM on this great occasion. He spoke of some of the key achievements of the Sri Lankan IT\/BPM sector in recent years mentioning that having achieved the $ 1 billion in exports target, he was confident that the sector will seamlessly achieve its $ 5 billion mark in the planned time. He noted: “Technology is a growth driver and the technology sector is an area that would differentiate Sri Lanka among neighbouring competitors, and help the island become a developed country. Along with the support of SLASSCOM and the entire sector, I am confident that Sri Lanka will get there soon.”<\/p>\n<p>The virtual event witnessed Jayantha De Silva and Channa Manoharan launching the state of the IT\/BPM industry report, at which point De Silva stated that the sector will be “using these publications extensively.”<\/p>\n<p>The next part of the event was the launch of the inaugural state of the BPM industry report, and kicked off with ACCA Head of South Asia Cluster Nilusha Ranasinghe addressing the gathering.<\/p>\n<p>Ranasinghe said “Our vision is to develop the accountancy profession that the world needs; we believe that a strong global accountancy profession benefits society by ensuring that organisations are managed ethically whilst creating rewarding career opportunities. It has been a pleasure partnering with SLASSCOM for the publication of the state of the BPM industry report as the BPM industry is an area that ACCA is extremely keen in collaborating. We will continue our 10-year collaborative partnership with SLASSCOM in future, to uplift the BPM sector with valuable information for decision-making.<\/p>\n<p>SLASSCOM BPM Forum Director Finance cum Board Lead Jehan Perinpanayagam noted: “One of the biggest challenges in the BPM sector was the lack of data, information and statistics, yet today for the first time today, we have the BPM state of the industry report comprising key information that are useful for professionals from various disciplines including and not limited to finance and accounting, analytics, legal and market research.”<\/p>\n<p>BPM Forum Lead Shanaka Fernando added, “This report will enlighten global BPM players to gain a good insight into the value that can be derived from choosing Sri Lanka as their future outsourcing destination.”<\/p>\n<p>The launch of these publications cement Sri Lanka’s accomplishment of leveraging its knowledge and innovations capabilities to position itself as a sought-after destination for IT\/BPM services in the world market.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Sri Lanka Association of Software and Services Companies (SLASSCOM) recently launched two new reports that comprised of the IT-BPM industry review ‘State of the Industry Report 2019\/20’ and the ‘SLASSCOM State of the BPM Industry Report’. This is the first time that a specific report on the BPM industry has been released. Thanking all [&hellip;]<\/p>\n","protected":false},"author":400,"featured_media":15868,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[47],"tags":[],"_links":{"self":[{"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/posts\/15867"}],"collection":[{"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/users\/400"}],"replies":[{"embeddable":true,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/comments?post=15867"}],"version-history":[{"count":1,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/posts\/15867\/revisions"}],"predecessor-version":[{"id":15869,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/posts\/15867\/revisions\/15869"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/media\/15868"}],"wp:attachment":[{"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/media?parent=15867"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/categories?post=15867"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/tags?post=15867"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}