{"id":15946,"date":"2021-10-04T16:14:08","date_gmt":"2021-10-04T11:14:08","guid":{"rendered":"https:\/\/slasscom.lk\/?p=15946"},"modified":"2021-10-04T16:38:17","modified_gmt":"2021-10-04T11:38:17","slug":"slasscoms-product-and-platform-council-is-making-headway-in-supporting-companies-to-scale-up","status":"publish","type":"post","link":"https:\/\/slasscom.lk\/slasscoms-product-and-platform-council-is-making-headway-in-supporting-companies-to-scale-up\/","title":{"rendered":"SLASSCOM’s Product and Platform Council is making headway in supporting companies to scale up"},"content":{"rendered":"<p>Since its inception in August, 2020, the Product and Platform Council (PPC) of Sri Lanka Association of Software and Services Companies (SLASSCOM) has been working with growing momentum to help increase the nation’s IT exports and IT revenue. Aligned to SLASSCOM’s vision of generating a revenue of USD 5 billion in exports by 2025, the PPC is focused on increasing the revenue from products and platforms to reach 10% of overall IT exports revenue.<\/p>\n<p>Out of its four focus groups – Academy, Scaleup Monitoring, Ecosystem, and Policy &amp; IP – the Ecosystem platform is dedicated to helping companies scale up their journey by enabling them to leverage skills, knowledge and networking, build brand presence and tap into global resources.<\/p>\n<p>Key activities of the Ecosystem platform includes building a community of product and platform companies, creating a partner ecosystem to support product companies, constructing a directory of products and platforms, and organising collaboration events and other networking meet-ups.<\/p>\n<p>Rajitha Kurupumulle – COO of BoardPac and Ecosystem Pillar Lead notes that the pillar acts as the foundation for other focus groups. “We want to create a platform for all product companies to come together as a community as we believe it is imperative to build and nurture a common platform for companies to interchange skills, knowledge and business opportunities. We will also be bringing in partners and service providers to build this much-needed ecosystem for companies to gear up and thrive in the international marketplace. The ecosystem platform will also be creating a comprehensive directory of product and platform companies to enable visibility to the local market and be a central point of information for parties looking to engage with Sri Lankan IT companies.<\/p>\n<p>He further added “The ecosystem pillar will focus on mature companies (which have finalised income-generating products and clients) and startups to help them scale up. The IT industry will be a key player in foreign revenue generation in our country – our growth is majorly lying with products and platforms, so facilitating this growth is the purpose of the PPC and therein, the Ecosystem pillar.”<\/p>\n<p>The PPC has identified several key support areas for scale ups, including certifications, partnerships with service providers, sourcing technical expertise and bridging knowledge gaps regarding the environment.<\/p>\n<p>The agenda of the PPC for the next few months includes working with several ecosystem partners to conduct sessions, such as the recently concluded Enterprise Risk Management Certifications it hosted for product and platform companies in partnership with Bureau Veritas. Also, focusing on providing mentorships to companies on scaling up, the PPC through all its focus groups will guide and groom several companies to go international – a feat that will be continually conducted covering the 100+ companies registered with the council. Mentoring will be provided harmoniously by all four focus groups adopting a holistic approach.<\/p>\n<p>The PPC is made of professional expert volunteers from the IT industry, with expertise in specific areas regarding products, platforms and funding, to name a few. With an advisory committee and executive committee made of senior industry members who are themselves founders of product companies, and with unified support from the members of the other focus groups, the Ecosystem pillar is well geared to carry out its purpose. <em> <\/em><\/p>\n<p>“The PPC was built to enable product companies to accelerate their growth to become strong brands in the global arena, and the council is making good speed in this endeavour, supported by all other forums of the chamber,” stated SLASSCOM Chairperson Sandra De Zoysa.<\/p>\n<p>Driven by its objectives of building an ecosystem and a community to generate knowledge and content, influence policy and provide coaching and mentoring, the PPC is optimistic about the future as it moves ahead in catalysing the scale up journey of IT product and platform companies.<\/p>\n<p>PPC invites anyone who is working on or interested in developing software products to join the<\/p>\n<p>PPC Community on SLACK via bit.ly\/slassppc<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Since its inception in August, 2020, the Product and Platform Council (PPC) of Sri Lanka Association of Software and Services Companies (SLASSCOM) has been working with growing momentum to help increase the nation’s IT exports and IT revenue. Aligned to SLASSCOM’s vision of generating a revenue of USD 5 billion in exports by 2025, the [&hellip;]<\/p>\n","protected":false},"author":400,"featured_media":15957,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/posts\/15946"}],"collection":[{"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/users\/400"}],"replies":[{"embeddable":true,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/comments?post=15946"}],"version-history":[{"count":1,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/posts\/15946\/revisions"}],"predecessor-version":[{"id":15947,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/posts\/15946\/revisions\/15947"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/media\/15957"}],"wp:attachment":[{"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/media?parent=15946"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/categories?post=15946"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/tags?post=15946"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}