{"id":15943,"date":"2021-10-04T16:11:02","date_gmt":"2021-10-04T11:11:02","guid":{"rendered":"https:\/\/slasscom.lk\/?p=15943"},"modified":"2021-10-04T16:11:02","modified_gmt":"2021-10-04T11:11:02","slug":"slasscom-launches-value-driven-program-to-enhance-the-skills-of-ict-educators-in-the-country","status":"publish","type":"post","link":"https:\/\/slasscom.lk\/slasscom-launches-value-driven-program-to-enhance-the-skills-of-ict-educators-in-the-country\/","title":{"rendered":"SLASSCOM launches value driven program to enhance the skills of ICT  Educators in the country"},"content":{"rendered":"<p>In its mission to uplift the ICT sector of the nation SLASSCOM, has identified the refinement of how the population is educated on subjects related to tech to be an essential accomplishment. With this goal in mind, SLASSCOM partnered the Vocational Training Authority (VTA) targeting the ICT instructors attached to VTA to host a transformative Teacher Training and Upskilling program and YouLead, USAID’s youth skills development and entrepreneurship project<\/p>\n<p>YouLead has already had a track record in contributing the upliftment of ICT professionals within Sri Lanka through the facilitation of an enduring public-private-donor partnership to address growing unemployment rate of youth studying ICT courses, which among other courses reports the highest unemployment of TVET graduates.<\/p>\n<p>Therefore the intent of the series of programs launched by SLASSCOM was  to drive and enhance the IT knowledge and skills of ICT educators in the hope that it leads to the creation of real-world ready, employable graduates that can contribute to the industry and cultivate successful careers.<\/p>\n<p>The five day interactive program was designed with the intent of empowering educators with salient industry knowledge such as tech career awareness. Adding to the importance of the information presented, they were trained through a growth mindset oriented program. The event provided an opportunity for teachers to gain skills and tools needed to approach their jobs differently and to increase employability of vocational youth through ‘Future Careers BRIDGE’ platform, while connecting students with private sector employment.<\/p>\n<p>The first phase of this series of programs, was conducted, in 2020 with the attendance of 217 ICT instructors from around the country.<\/p>\n<p>The attendees of the event were kept engaged from the first day, with an interactive pre-assessment of the program, followed by a detailed discussion on how the participating educators stood to gain from the proceedings of the program. The event was conducted with a smattering of group and individual activities, promoting engagement of its attendees while educating them through intelligent discussion. The discussion continued with a program dedicated to future career prospects within the industry as well as BRIDGE. This spirited segment saw the discussion of the importance of BRIDGE as well as how educators could promote BRIDGE to their students.<\/p>\n<p>Among many other topics, one that stood out was the discussion on value addition in a student’s journey, conducted by Mr. Fahad Farook which mapped out a student’s journey while identifying where and how value could be added to their education.<\/p>\n<p>The program was endorsed by many of the participating ICT educators who outlined that the program had been a very insightful , with valuable takeaways and tips on guiding students  through their respective degrees to learning to look at problem solving in a different perspective .<\/p>\n<p>SLASSCOM is committed to continue to improve the future of Sri Lanka’s tech industry by initiating and launching  programs of this nature to enhanced the skill sets of the It educators that will in turn result  in the  students  being equipped with the requisite skills required by the  ICT industry.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In its mission to uplift the ICT sector of the nation SLASSCOM, has identified the refinement of how the population is educated on subjects related to tech to be an essential accomplishment. With this goal in mind, SLASSCOM partnered the Vocational Training Authority (VTA) targeting the ICT instructors attached to VTA to host a transformative [&hellip;]<\/p>\n","protected":false},"author":400,"featured_media":15944,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/posts\/15943"}],"collection":[{"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/users\/400"}],"replies":[{"embeddable":true,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/comments?post=15943"}],"version-history":[{"count":1,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/posts\/15943\/revisions"}],"predecessor-version":[{"id":15945,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/posts\/15943\/revisions\/15945"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/media\/15944"}],"wp:attachment":[{"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/media?parent=15943"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/categories?post=15943"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/tags?post=15943"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}