{"id":11857,"date":"2020-01-11T08:16:10","date_gmt":"2020-01-11T08:16:10","guid":{"rendered":"https:\/\/slasscom.lk\/?page_id=11857"},"modified":"2020-11-16T14:23:08","modified_gmt":"2020-11-16T09:23:08","slug":"code-of-ethics","status":"publish","type":"page","link":"https:\/\/slasscom.lk\/code-of-ethics\/","title":{"rendered":"Code of Ethics"},"content":{"rendered":"<p>[vc_row][vc_column][vc_empty_space height=&#8221;20px&#8221;][vc_custom_heading text=&#8221;CODE OF ETHICS&#8221; font_container=&#8221;tag:h1|text_align:center|color:%239d1e3c&#8221; google_fonts=&#8221;font_family:Abel%3Aregular|font_style:400%20regular%3A400%3Anormal&#8221;][vc_empty_space height=&#8221;20px&#8221;][vc_column_text]<span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">This Code of Ethics and Standards of Practice shall apply to all member organizations. Its intention is to identify the ethical principles and best practices that member organizations of SLASSCOM must consider essential to develop the Software and IT-enabled Services sector in Sri Lanka. The establishment of which is essential to winning and holding customer confidence and creates a foundation of a successful industry in Sri Lanka.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">This Code does not purport to replace legal advice or provide legal guidance. Members should inform themselves about relevant laws that may be applicable to the industry including but not limited to employee-related legislation and Inland Revenue Department regulations.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">The Code sets out the fundamental principles that have to be observed by members in order to achieve common objectives of SLASSCOM. Unless a limitation is specifically stated, the objectives and fundamental requirements are equally valid for all members, whether public or private bodies.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-family: Roboto; font-size: 14pt; color: #000000;\"><strong>1) Adoption, Scope, and Application<\/strong><\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Throughout this Code, the use of the word “must” indicates that a clause is compulsory for members. The use of the word “should” indicates that the clause is not compulsory but strongly encouraged as a best practice. This Code is applicable to all companies, associations, and other entities that have subscribed to membership of SLASSCOM.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Any SLASSCOM member is free to terminate its membership with SLASSCOM. All members of SLASSCOM shall be bound by this Code which shall remain applicable during the entire period of membership.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Each member of SLASSCOM agrees irrevocably to uphold and promote this Code and acknowledge that violations of any provisions of this Code as being inconsistent with membership of SLASSCOM. SLASSCOM members must confirm their compliance with this Code annually.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Each member of SLASSCOM must acknowledge that this Code has been adopted and applied in order to enhance and promote ethics, professional conduct, and discipline amongst SLASSCOM members and to safeguard and enhance the common goals and interests. This Code shall be interpreted and applied in this spirit by SLASSCOM and each member thereof.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">In cases of doubt regarding the application or interpretation of this Code, a SLASSCOM member or a representative of any SLASSCOM member is entitled to refer the matter to the Board of Directors of SLASSCOM for clarification and direction, the Board shall act without delay in such matters. The Member will be bound by such clarification or determination made by the Board.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-family: Roboto; font-size: 14pt; color: #000000;\"><strong>2) Objectives<\/strong><\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">This Code recognizes that a core objective of SLASSCOM is to encourage members to display the highest standards of professionalism. By setting out standards of best practice and ethical guidelines to be adhered to by SLASSCOM members, the Code shall be a driving force in achieving SLASSCOM objectives. The Code identifies four basic principles.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\"><strong>a) Integrity<\/strong><\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Members must act with integrity and exercise diligence and respect in all dealings with customers, prospective customers, employees, competitors (whether members or non-members of SLASSCOM), third party contractors, suppliers, government and regulatory agencies and with the general public.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\"><strong>Ethics in Customer relationships<\/strong><\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Members shall have a responsibility to act ethically and in the best interests of its customers. Members should ensure that the terms and conditions of its relationship with each customer is documented in contract form and adhere to the terms of such contractual commitments in the performance of its obligations. Members should always strive to provide the highest quality services to its customers; to seek business openly and honestly; to safeguard customers&#8217; property, whether physical assets or intellectual property; and to follow accurate and transparent billing procedures.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\"><strong>Ethics in employee relationships<\/strong><\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Members must treat all employees with equal respect and dignity. Employees shall be provided with equal opportunity to develop themselves. Members shall ensure that evaluating people for the purpose of recruitment, training, development or promotion shall be made solely on the basis of the individual’s ability and potential relative to the needs of the job, and take into account only those matters relevant to the performance of that job. Members shall be committed to providing employees with a workplace that supports diversity and where employees’ differences are valued and respected. Discrimination and harassment, whether based on a person’s race, gender, religion, color, national origin, age, disability, marital status, sexual orientation or any other factor in the workplace against any of its employees should not be related.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\"><strong>Ethics in competitor relationships<\/strong><\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Members shall seek to outperform its competitors fairly and honestly. Competitive advantage should be sought based on superior professional performance and never through unethical or illegal business practices. Members should only use legal and ethical methods to gather competitive information. It is prohibited to steal proprietary information, possess trade secret information that was obtained without the owner’s consent or induce such disclosures by past or present employees of other companies.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\"><strong>Ethics in third party contractors\/supplier relationships<\/strong><\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Members shall act ethically and with responsibility in dealing with third party contractors, consultants and suppliers (“Suppliers”). Members shall ensure that terms of business are clearly agreed and strive to build stable relationships with their Suppliers. Award of business should be based on Supplier’s ability to meet Member requirements and commitments, reputation for service, integrity and compliance and their high standards for quality delivery and pricing propositions. Members should, as a policy, discourage the receipt of gifts either directly or indirectly, by Suppliers, since acceptance may be misconstrued as an attempt to influence business decisions. This does not apply to unsolicited promotional materials of a general advertising nature, as long as it is accepted without any express or implied understanding that the recipient is in any way obligated.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\"><strong>Ethics in dealing with government and regulatory agencies<\/strong><\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Members must act ethically in all dealings with government and regulatory agencies. Ethical breaches such as bribery, fraud, corruption must not be tolerated. Members must act in accordance with all applicable laws, rules and regulations in force, in respect of their business.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\"><strong>Ethics in dealing with the general public<\/strong><\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Members shall strive to be good corporate citizens and contribute to the sustainable development of society. Members shall assume long term accountability, both for ethical issues with a direct impact on its customers, employees, and business and, in a broader sense, for society and the environment.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\"><strong>b) Professional and Technical Competence and Due Care<\/strong><\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Members shall seek to upgrade their professional knowledge and skill, and shall maintain awareness of developments, procedures and standards which are relevant to their field. Members should adopt a program designed to ensure quality control in the performance of professional services, consistent with appropriate national and international standards so far as is practicable.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\"><strong>c) Confidentiality<\/strong><\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Members must safeguard the confidentiality, integrity and availability of information assets relating to the member, customers, employees, suppliers and third parties. The cornerstone of the industry is built on maintaining the confidentiality and integrity of confidential information and members must protect and enhance the reputation of Sri Lanka as a secure location.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\"><strong>d) Cooperation between members<\/strong><\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\"><strong>Publicity for outsourcing in Sri Lanka<\/strong><\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Members shall work together to promote and publicize internationally, the potential and possibilities of the Software and IT enabled Services sector in Sri Lanka. SLASSCOM will spearhead and initiate promotional efforts of this nature from time to time.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\"><strong>Joint efforts to lobby government<\/strong><\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Members shall unite and lobby government through SLASSCOM in respect of improvements, advancements, benefits and other facilities to be offered to the Software and IT-enabled Services sector in Sri Lanka.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\"><strong>Non-solicitation<\/strong><\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Members shall not take any action to directly solicit, induce or encourage employees of other member organizations who are involved in SLASSCOM activities to join such member or any third party or otherwise breach their contracts of employment, with other member organizations, to encourage active contribution to SLASSCOM and to the industry without concern. “Soliciting” excludes applications in response to employment or contracting opportunities publicly placed in any media targeting the general public; applications received from recruitment specialists; and\/or as a result of the applicant directly applying to the Member. A Service certificate with confirmation that notice period has been served out to be provided by all employees joining a member.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-family: Roboto; font-size: 14pt; color: #000000;\"><strong>3) Disciplinary Procedures<\/strong><\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">SLASSCOM may take disciplinary action against any member which acts in a manner inconsistent or contrary to the provisions of this Code or does not comply with any of the provisions, directives and expectations set out herein in this Code. Each member hereby expressly grants and confers to SLASSCOM such jurisdiction to take such disciplinary action as prescribed herein.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Members shall be responsible for and shall take disciplinary action against those employees contractors or other affiliates of such members over whom such member exercises control, in the event of breach by such parties of the provisions of this Code.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">For the purpose of taking disciplinary action, the Board of SLASSCOM shall appoint a permanent disciplinary committee. The following shall be ex officio members of the disciplinary committee: Chairman and Deputy Chairmen of the Board of SLASSCOM.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Without prejudice to the generality of powers of the disciplinary committee, disciplinary action may include warning, admonition, suspension or cancellation of membership of any member of SLASSCOM.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">The disciplinary committee may establish the procedures relating to the meetings, inquiries and disciplinary action by the committee, the period of appointment to the committee and the appointment of members to the committee in the event of resignation or incapacitation or death of any member of the committee. The first appointments to the committee shall be made by the Board of SLASSCOM.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">The decision of SLASSCOM in relation to any disciplinary matter as prescribed above shall be final and conclusive and shall not be questioned or challenged in any manner except insofar as specifically enabled or authorized by law.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-family: Roboto; font-size: 14pt; color: #000000;\"><strong>4) Application and Interpretation<\/strong><\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">This Code shall always be applied and interpreted having regard to the spirit of SLASSCOM and the objectives sought to be achieved by the introduction and implementation of the Code.<\/span>[\/vc_column_text][vc_empty_space height=&#8221;40px&#8221;][\/vc_column][\/vc_row]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>[vc_row][vc_column][vc_empty_space height=&#8221;20px&#8221;][vc_custom_heading text=&#8221;CODE OF ETHICS&#8221; font_container=&#8221;tag:h1|text_align:center|color:%239d1e3c&#8221; google_fonts=&#8221;font_family:Abel%3Aregular|font_style:400%20regular%3A400%3Anormal&#8221;][vc_empty_space height=&#8221;20px&#8221;][vc_column_text]This Code of Ethics and Standards of Practice shall apply to all member organizations. Its intention is to identify the ethical principles and best practices that member organizations of SLASSCOM must consider essential to develop the Software and IT-enabled Services sector in Sri Lanka. The establishment of which [&hellip;]<\/p>\n","protected":false},"author":298,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"page.php","meta":{"_links_to":"","_links_to_target":""},"_links":{"self":[{"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/pages\/11857"}],"collection":[{"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/users\/298"}],"replies":[{"embeddable":true,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/comments?post=11857"}],"version-history":[{"count":34,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/pages\/11857\/revisions"}],"predecessor-version":[{"id":14284,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/pages\/11857\/revisions\/14284"}],"wp:attachment":[{"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/media?parent=11857"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}