{"id":57,"date":"2019-09-29T16:49:05","date_gmt":"2019-09-29T11:19:05","guid":{"rendered":"https:\/\/slasscom.lk\/?page_id=57"},"modified":"2020-11-16T14:30:54","modified_gmt":"2020-11-16T09:30:54","slug":"srilanka-advantage","status":"publish","type":"page","link":"https:\/\/slasscom.lk\/srilanka-advantage\/","title":{"rendered":"Sri Lanka Advantage"},"content":{"rendered":"<p>[vc_row][vc_column][vc_empty_space][\/vc_column][\/vc_row][vc_row][vc_column][vc_custom_heading text=&#8221;SRI LANKA ADVANTAGE&#8221; font_container=&#8221;tag:h2|text_align:center|color:%239d1e3c&#8221; google_fonts=&#8221;font_family:Abel%3Aregular|font_style:400%20regular%3A400%3Anormal&#8221;][\/vc_column][\/vc_row][vc_row][vc_column][vc_empty_space height=&#8221;20px&#8221;][\/vc_column][\/vc_row][vc_row equal_height=&#8221;yes&#8221;][vc_column width=&#8221;1\/2&#8243;][vc_custom_heading text=&#8221;The Sri Lankan IT-BPM Industry&#8221; font_container=&#8221;tag:h3|text_align:justify|color:%23000000&#8243; google_fonts=&#8221;font_family:Abel%3Aregular|font_style:400%20regular%3A400%3Anormal&#8221;][vc_empty_space height=&#8221;5px&#8221;][vc_column_text]<span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Sri Lanka is emerging as a global destination of choice for knowledge solutions. Sri Lanka is ranked among the Top 15 Global Outsourcing destinations by AT Kearney and ranked among Top 20 Emerging Cities by Global Services Magazine. Sri Lanka has won the ‘Outsourcing Destination of the Year’ accolade awarded by the National Outsourcing Association UK successively in 2013 and 2014. Sri Lanka&#8217;s knowledge services industry is the fifth largest export earner for Sri Lanka in 2018 and is currently estimated to be USD 1.2 billion with over 80,000 employees engaged in the industry. The knowledge solutions industry has been identified as a thrust industry by the government within the National Export Strategy (NES) and targets USD 5 billion of exports while creating 200,000 new jobs and 1,000 startups by 2022.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">The growing knowledge solutions industry in Colombo offers a unique advantage for Small and Medium Enterprises (SME) to enjoy premium access to a high quality talent pool, which is becoming increasingly challenging in large established destinations such as India and China. The environment is also highly conducive for establishing high-in-demand niche competency centers for larger global services companies as well.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">The national level competency development programs focus on building Sri Lanka as a Center of Excellence (COE) for multiple domains. The software services sector focuses on Telecommunication, Banking Financial Services and Insurance (BFSI) and Healthcare. The BPM sector focus on Financial &amp; Accounting services, Investment Research, Engineering Services and UK-based Legal Services. There are over 300 IT and BPM companies that operate in Sri Lanka, including many large global players. Some key organizations include HSBC, WNS Global Services, IFS, Moody&#8217;s Analytics, RR Donnelley, Virtusa, Pearson, London Stock Exchange Group and Innodata.<\/span>[\/vc_column_text][\/vc_column][vc_column width=&#8221;1\/2&#8243;][vc_empty_space height=&#8221;55px&#8221;][vc_single_image image=&#8221;11925&#8243; img_size=&#8221;500&#215;500&#8243;][\/vc_column][\/vc_row][vc_row][vc_column][vc_empty_space][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/2&#8243;][vc_empty_space height=&#8221;55px&#8221;][vc_single_image image=&#8221;13610&#8243; img_size=&#8221;500&#215;500&#8243;][\/vc_column][vc_column width=&#8221;1\/2&#8243;][vc_custom_heading text=&#8221;Workforce Advantage&#8221; font_container=&#8221;tag:h3|text_align:justify|color:%23000000&#8243; google_fonts=&#8221;font_family:Abel%3Aregular|font_style:400%20regular%3A400%3Anormal&#8221;][vc_empty_space height=&#8221;5px&#8221;][vc_column_text]<span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Sri Lanka offers a rapidly growing workforce which is highly adaptable, English speaking and committed to high-quality delivery. Currently, over 80,000 are employed in the IT and BPM industry in Colombo and the workforce is growing at over 20% year-on-year. The workforce is stable with very low attrition rates ranging from 5-15%. Colombo is comparatively cost competitive and has a lower upward wage pressure than many established global sourcing destinations.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Sri Lanka has an established norm of early entry of individuals to the workforce soon after college. Many follow short diploma’s and certification programs which allow people to enter in to the workforce early. The well developed work-study approach allows people to work and study at the same time. Sri Lankans are noticeably friendly, highly productive, creative, and adapt very fast to different cultures and environments. This results in easy integration to operating units of other counties. The primary business language in Colombo is English with a high level of fluency.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Schooling up to secondary level is free and widespread, leading to the country’s high 91% literacy rate. Graduate and Postgraduate education is provided by the 15 state universities and numerous private universities and educational institutions, many of which award degrees from international universities. With many incentives by the government, Sri Lanka is attracting leading foreign universities and many private investments in education. Students can study for degrees from leading global universities such as Monash, Curtin, Staffordshire, Manchester Metropolitan and many other universities from UK, Australia, USA and India while in Sri Lanka, becoming an education hub for students from neighboring countries.<\/span>[\/vc_column_text][\/vc_column][\/vc_row][vc_row][vc_column][vc_empty_space][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/2&#8243;][vc_custom_heading text=&#8221;Business Climate &amp; Investment Incentives&#8221; font_container=&#8221;tag:h3|text_align:justify|color:%23000000&#8243; google_fonts=&#8221;font_family:Abel%3Aregular|font_style:400%20regular%3A400%3Anormal&#8221;][vc_empty_space height=&#8221;5px&#8221;][vc_column_text]<span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Sri Lanka has an open market economy and is the first country in South Asia to liberalize its economy. Many global companies have been operating in Sri Lanka for decades. Chevron, General Electric, Citigroup, Hewlett-Packard, Microsoft, Pfizer, Intel, RedHat, Saatchi &amp; Saatchi, IBM, 3M, Sara Lee Courtaulds, Unilever, British American Tobacco, Smith Kline Beecham, TCS, Indian Oil Corporation, NTT, Telecom Malaysia, WIPRO; are few global companies among them.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">The Sri Lankan economy has proved to be resilient with the Central Bank of Sri Lanka projecting a growth rate of 7% in 2008 – one of the highest rates in decades. Sri Lankan government has identified the IT-BPM sector as a priority growth sector for economic development and provides many incentives to promote investments. In 2007, the country attracted the highest ever FDI of US$700m.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Tax holidays range from 5-12 years. In addition, a concessionary rate of income tax of 15% up to a maximum period of 20 years is also extended after the tax holiday period. Government also provides special assistance on real estate acquisition based on investment and employment generation potential.<\/span><br \/>\n<span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Government also provides substantial cash grants for companies in the IT-BPM sector to support the business development and encourage investments. Grants are provided for Training, Consulting expertise, Marketing, Quality enhancements (CMMi, COPC, ISO etc.) and for a host of other developmental activities.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Sri Lanka has an independent judiciary and follows the British Commercial Law principles and practices in its legal system. Sri Lanka is a signatory to international treaties on Intellectual property rights such as the Berne Convention and WTO\/TRIPS and adopted a comprehensive IP regime [Act No. 36 of 2003]. Sri Lanka also enacted an Electronics Transactions Act, Computer Crimes Act and is a signatory to the latest UN e-contracting convention. A Data Protection Code of Practice is also under preparation.<\/span>[\/vc_column_text][\/vc_column][vc_column width=&#8221;1\/2&#8243;][vc_empty_space height=&#8221;55px&#8221;][vc_single_image image=&#8221;11948&#8243; img_size=&#8221;500&#215;500&#8243;][\/vc_column][\/vc_row][vc_row][vc_column][vc_empty_space][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/2&#8243;][vc_empty_space height=&#8221;55px&#8221;][vc_single_image image=&#8221;11949&#8243; img_size=&#8221;500&#215;500&#8243;][\/vc_column][vc_column width=&#8221;1\/2&#8243;][vc_custom_heading text=&#8221;Tier 1 Infrastructure with a Tier 2 Cost Structure&#8221; font_container=&#8221;tag:h3|text_align:justify|color:%23000000&#8243; google_fonts=&#8221;font_family:Abel%3Aregular|font_style:400%20regular%3A400%3Anormal&#8221;][vc_empty_space height=&#8221;5px&#8221;][vc_column_text]<span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Sri Lanka has eight telecom operators and is connected to the world with three international submarine cables providing ample redundancy. Broadband, Leased-line and Satellite connectivity are widely available.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Sri Lanka is the first country in South Asia to trial 5G technology and was also the first in commercially launching 4G-LTE network. The Telecommunications Regulatory Commission (TRC) of Sri Lanka also provides special access facilities to IT and BPM companies enabling easy import of equipment and commissioning of international connectivity.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Colombo has a well established road network with a quality supply of power, modern office facilities and a well developed set of support infrastructure services.<\/span><\/p>\n<p><span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">There are over 140 flights per week to most cities in India. Most Indian cities are less than 2 hours away from Sri Lanka. The modern international airport welcomes more than 20 international airlines with direct flights to many worldwide destinations weekly.<\/span>[\/vc_column_text][\/vc_column][\/vc_row][vc_row][vc_column][vc_empty_space][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/2&#8243;][vc_custom_heading text=&#8221;Living and Working in Sri Lanka&#8221; font_container=&#8221;tag:h3|text_align:justify|color:%23000000&#8243; google_fonts=&#8221;font_family:Abel%3Aregular|font_style:400%20regular%3A400%3Anormal&#8221;][vc_empty_space height=&#8221;5px&#8221;][vc_column_text]<span style=\"font-family: Roboto; font-size: 12pt; color: #000000;\">Sri Lanka offers ample recreational facilities within just 2 to 3 hours of driving from Colombo. Exquisite beaches, wild life sanctuaries, cultural heritage sites dating back to 500 B.C., beautiful hill country views, surfing, water sports, and exciting night life makes Sri Lanka a truly a tropical paradise to live and work in. Mixing business and pleasure has never been this easy for the discerning expatriate professionals or to the frequent business traveler.<\/span>[\/vc_column_text][\/vc_column][vc_column width=&#8221;1\/2&#8243;][vc_empty_space height=&#8221;55px&#8221;][vc_single_image image=&#8221;13168&#8243; img_size=&#8221;500&#215;500&#8243;][\/vc_column][\/vc_row][vc_row][vc_column][vc_empty_space][\/vc_column][\/vc_row]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>[vc_row][vc_column][vc_empty_space][\/vc_column][\/vc_row][vc_row][vc_column][vc_custom_heading text=&#8221;SRI LANKA ADVANTAGE&#8221; font_container=&#8221;tag:h2|text_align:center|color:%239d1e3c&#8221; google_fonts=&#8221;font_family:Abel%3Aregular|font_style:400%20regular%3A400%3Anormal&#8221;][\/vc_column][\/vc_row][vc_row][vc_column][vc_empty_space height=&#8221;20px&#8221;][\/vc_column][\/vc_row][vc_row equal_height=&#8221;yes&#8221;][vc_column width=&#8221;1\/2&#8243;][vc_custom_heading text=&#8221;The Sri Lankan IT-BPM Industry&#8221; font_container=&#8221;tag:h3|text_align:justify|color:%23000000&#8243; google_fonts=&#8221;font_family:Abel%3Aregular|font_style:400%20regular%3A400%3Anormal&#8221;][vc_empty_space height=&#8221;5px&#8221;][vc_column_text]Sri Lanka is emerging as a global destination of choice for knowledge solutions. Sri Lanka is ranked among the Top 15 Global Outsourcing destinations by AT Kearney and ranked among Top 20 Emerging Cities by Global Services Magazine. Sri [&hellip;]<\/p>\n","protected":false},"author":298,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"page.php","meta":{"_links_to":"","_links_to_target":""},"_links":{"self":[{"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/pages\/57"}],"collection":[{"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/users\/298"}],"replies":[{"embeddable":true,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/comments?post=57"}],"version-history":[{"count":59,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/pages\/57\/revisions"}],"predecessor-version":[{"id":14305,"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/pages\/57\/revisions\/14305"}],"wp:attachment":[{"href":"https:\/\/slasscom.lk\/wp-json\/wp\/v2\/media?parent=57"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}